doc/BUILD/source/_static/soap_outputs/6.2.314.3321/create_action_from_json_step_5_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <action>
          <comment>Scans for unmanaged assets on the network.</comment>
          <status>Expired</status>
          <distribute_seconds>600</distribute_seconds>
          <start_time>2015-08-07T11:49:58</start_time>
          <creation_time>2015-08-07T11:49:58</creation_time>
          <skip_lock_flag>0</skip_lock_flag>
          <expire_seconds>1800</expire_seconds>
          <name>Unmanaged Asset Tracking - Run Scan</name>
          <stopped_flag>0</stopped_flag>
          <expiration_time>2015-08-07T12:19:58</expiration_time>
          <package_spec>
            <name>Run Unmanaged Asset Scanner</name>
            <command>cmd /c start /B cscript //T:3600 ..\..\Tools\run-ua-scan.vbs /RANDOM_WAIT_TIME_IN_SECONDS:240</command>
            <id>6</id>
          </package_spec>
          <saved_action>
            <id>1</id>
          </saved_action>
          <history_saved_question>
            <id>173</id>
          </history_saved_question>
          <target_group>
            <name>Default</name>
            <id>64</id>
          </target_group>
          <action_group>
            <name>Default</name>
            <id>0</id>
          </action_group>
          <user>
            <name>Jim Olsen</name>
            <last_login>2015-08-07T12:16:41</last_login>
            <group_id>0</group_id>
            <id>1</id>
          </user>
        </action>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>